"""
Задача №2
Шахова тура ходить по горизонталі або вертикалі.
Дано дві різні клітинки шахової дошки, визначте, чи може тура потрапити з першої клітинки на другу за один хід.
Програма отримує на вхід чотири числа від 1 до 8 кожне,
що задають номер стовпця і номер рядка спочатку для першої клітинки, потім для другої клітинки.
Програма повинна вивести Yes, якщо з першої клітинки ходом тури можна потрапити в другу або No в іншому випадку.

Автор: Задворна Анастасія Богданівна
"""

x1 = int(input("Введіть номер стовпця для першої клітинки (від 1 до 8): "))
y1 = int(input("Введіть номер рядка для першої клітинки (від 1 до 8): "))

x2 = int(input("Введіть номер стовпця для другої клітинки (від 1 до 8): "))
y2 = int(input("Введіть номер рядка для другої клітинки (від 1 до 8): "))

if x1 == x2 or y1 == y2:
    print("Yes")
else:
    print("No")
    
