'''
Задача №1
Залежно від розміру суми, розмір податку з неї розраховується за такою схемою:
якщо сума не перевищує деяку величину a, то податок не вираховується;
якщо сума більша за a, але не перевищує b, то податок становить 10%;
якщо сума більша за b, але не перевищує c, то податок становить 25%;
якщо сума більша c, то податок становить 50%. Визначити, який податок (дійсне число) буде вираховано із суми розміром s.
Дані (цілі числа) вводяться в такому порядку: a, b, c, s.

Автор: Задворна Анастасія Богданівна
'''

a = int(input("Введіть значення a: "))
b = int(input("Введіть значення b: "))
c = int(input("Введіть значення c: "))
s = int(input("Введіть розмір суми s: "))

tax = 0
if s > a and s <= b:
    tax = 10
elif s > b and s <= c:
    tax = 25
elif s > c:
    tax = 50
s_tax = s * tax / 100

print(f"Податок з суми {s} становить: {tax}")

